; ╔══════════════════════════════════════════════════════════════════════╗
; ║                         AHK BU NIKANT                                ║
; ╚══════════════════════════════════════════════════════════════════════╝
#NoEnv
SetBatchLines, -1
SetWorkingDir, %A_ScriptDir%
CoordMode, Pixel, Screen
CoordMode, Mouse, Screen
Random, ran, 2500, 5000

;---------------------------------------------------------------
; Прозьба не использовать данный скрипт в незаконных целях
; Пожалуйста не мейте то что не нужно и не ломайте то что работает
;---------------------------------------------------------------

; ╔══════════════════════════════════════════════════════════════════════╗
; ║                     ahk by nikant: Основной блок                     ║
; ╚══════════════════════════════════════════════════════════════════════╝

CheckLogin()
{
    loop, 100 {
        ; Читаем пароль из файла
        IniRead, Password, conf.ini, Setup, Password

        ; Получаем цвета пикселей
        PixelGetColor, Color_tt, 827, 416, RGB
        PixelGetColor, Color_rr, 855, 437, RGB
        PixelGetColor, Color_uy, 940, 437, RGB

        if (Color_tt = 0xFC8C21 and Color_rr = 0xFCAF25 and Color_uy = 0xFFFFFF) {
            sleep_queue()

            PixelGetColor, Color_qu, 840, 621, RGB
            PixelGetColor, Color_eu, 847, 621, RGB

            if (Color_qu = 0xFFFFFF and Color_eu = 0xFFFFFF) {
            } else {
                sleep_queue()
                Click, 881, 618
                Sleep, 150
                SendInput, %Password%
                Send, {Enter}
                sleep_queue()
            }
        }
        ; Проверяем наличие изображения
        ImageSearch, , , 1687, 237, 1905, 782, *60 images/pers.png
        if (ErrorLevel = 0) {
            PerformActions()
        }

    }
}

PerformActions()
{
    Random, ran, 2000, 5000
    ; ╔══════════════════════════════════════════════════════════════════════╗
    ; ║   Координаты можно узнать через любое приложение, такое как:         ║
    ; ║   - Just Color Picker                                                ║
    ; ║   - ShareX                                                           ║
    ; ║   - Spy                                                              ║
    ; ║   и другие аналогичные инструменты.                                  ║
    ; ╚══════════════════════════════════════════════════════════════════════╝
    Sleep, %ran%
    ;---------------------------------------------------------------
    ;Если у вас созданный все 3 персонажа, то можно использовать кординаты указаные ниже:
    ;Первый персонаж 1480, 386
    ;Второй персонаж 1511, 533
    ;Третий персонаж 1547, 695
    ;---------------------------------------------------------------
    Click, 1532, 466 ; Нужно изменить персонажа
    ;---------------------------------------------------------------

    Sleep, %ran%
    Click, 952, 945
    Sleep, 7777

    ;---------------------------------------------------------------
    Click, 965, 976 ; Нужно изменить кординаты  на последнего место выхода
    ;---------------------------------------------------------------

    Sleep, %ran%
    Click, 952, 805

    IniWrite, 1, conf.ini, Setup, ends
    ExitApp
}

sleep_queue()
{
    ; Проверяем цвета для ожидания
    PixelGetColor, greere, 859, 735, RGB
    PixelGetColor, greere1, 899, 735, RGB
    PixelGetColor, greere2, 936, 808, RGB
    while (greere = 0x49E703 and greere1 = 0x48E502) {
        Sleep, 500
        PixelGetColor, greere, 859, 735, RGB
        PixelGetColor, greere1, 899, 735, RGB
        PixelGetColor, greere2, 936, 808, RGB
    }
}

; ╔══════════════════════════════════════════════════════════════════════╗
; ║                       ahk by nikant: Конец скрипта                   ║
; ╚══════════════════════════════════════════════════════════════════════╝

CheckLogin()
Return
